Repository: git-learning-game/oh-my-git
Catalog: locale/*.po
Languages: it

source: These are your cards! Drag them to highlighted areas to play them!
it: Queste sono le tue carte! Spostale nell'area evidenziata per usarle!

source: Draw new cards
it: Pesca nuove carte

source: title
it: titolo

source: Save
it: Salva

source: filename
it: nome file

source: English
it: Inglese

source: Italian
it: Italiano

source: Good job, you solved the level! Feel free to try a few more things or click 'Next level'.
it: Ottimo lavoro, hai risolto il livello! Sentiti libero di provare qualche altra cosa o clicca su 'Prossimo livello'

source: Complete the goal of this level
it: Completa l'obbiettivo di questo ivello!

source: You get a golden badge for each level you solve without using the playing cards! Can you solve them all using the command line?
it: Ti aggiudicherai un badge d'oro per ogni livello che risolverai senza usare le cards! Puoi risolverli usando solo la linea di comando?

source: Help us improving Oh My Git! by answering some questions:
it: Aiutaci a migliorare Oh My Git! Rispondendo ad alcune domande:

source: To the survey /o/
it: Al sondaggio /o/

source: Back
it: Indietro

source: Reload
it: Ricarica

source: Cards!
it: Carte!

source: Tip!
it: Mancia!

source: Next level
it: Prossimo livello

source: Toggle music
it: Musica

source: Levels
it: Livelli

source: Install
it: Installa

source: You can drag these around with your mouse!
it: Puoi trascinarli in giro con il mouse!

source: Got it!
it: Fatto!

source: Interesting!
it: Interessante

source: Very useful!
it: Veramente utile!

source: Cool!
it: Bello!

source: Nice!
it: Bene!

source: Thanks!
it: Grazie!

source: Whatever...
it: Ad ogni costo...

source: Okay!
it: Ok!

source: Awesome!
it: Eccezionale!

source: This is a hint! This is a hint! This is a hint! This is a hint! This is a hint! This is a hint! This is a hint! This is a hint! This is a hint!
it: Questo è un suggerimento! Questo è un suggerimento! Questo è un suggerimento! Questo è un suggerimento! Questo è un suggerimento! Questo è un suggerimento! Questo è un suggerimento! Questo è un suggerimento! Questo è un suggerimento!

source: This is the time machine of another person! To interact with it, you need special commands!
it: Questa è la macchina del tempo di u'altra persona! Per interagirci hai bisogno di comandi speciali!

source: Update
it: Aggiorna

source: Hide trees and blobs
it: Nascondi alberi e macchie

source: Quit
it: Esci

source: Thank you very much for playing! Please help us improve Oh My Git! by filling out this survey:
it: Grazie mille per aver giocato! Aiutaci a migliorare Oh My Git! compilando questo sondaggio:

source: This is your terminal! All commands are executed here, and you can see their output. You can also type your own commands here!
it: Questo è il tuo terminale! Tutti i comandi sono eseguiti qui e puoi vedere il loro output. Puoi anche digitare i tuoi comandi qui!

source: Text here
it: Il testo qui

source: Language
it: Linguaggio

source: Drag this card into the empty space above to initialize the time machine!
it: Trascina questa carta nell'area vuota sopra per inizializzare la macchina del tempo

source: Create your own copy of someone else's repo.
it: Crea la tua copia personale del Repo di qualcun'altro.

source: Set your name. (Will not change anything outside of this game.)
it: Imposta il tuo nome. (Non cambierà nulla all'infuori del gioco.)

source: Set your email address.
it: Imposta la tua e-mail.

source: Drag this card to a commit or to a branch to travel to it!
it: Trascina questa carta su un commit o su un branch per spostarti su di esso.

source: Reset changes in a local file.
it: Resetta i cambiamenti in un file locale

source: Get the file contents from the specified commits, and reset both the working directory, as well as the index, to it.
it: Ottieni il contenuto dei file dai commit specificati e resetta sia la directory di lavoro sia l'indice.

source: Make a new commit, after automatically adding all changes to the index. You'll be asked to enter a short description of what you changed.
it: Crea un nuovo commit, dopo aver aggiunto automaticamente tutti i cambiamenti all'indice. Dovrai inserire una breve descrizione di cosa hai cambiato.

source: Make a new commit containing your current environment! Type in a description of what changed!
it: Crea un commit contenente il tuo ambiente attuale! Scrivi una descrizione di cosa è cambiato!

source: Merge the specified timeline into yours. If necessary, will create a merge commit.
it: Unisce la linea temporale specificata con la tua. Se necessario, creerà un commit di merge.

source: Abort the current merge attempt, and reconstruct the previous state.
it: Interrompe il corrente tentativo di unione e ricostruisce lo stato precedente.

source: Put the events in your current timeline on top of the specified one.
it: Mette gli eventi della tua linea temporale corrente sulla linea temporale specificata.

source: Get someone else's version of the current timeline, and try to merge it into yours.
it: Prende la versione di qualcun'altro della temporale corrente e prova ad unirla alla tua.

source: Get a someone else's version of the current timeline.
it: Prende la versione di qualcun'altro della temporale corrente

source: Give the current timeline to someone else.
it: Invia la linea temporale corrente a qualcun'altro

source: Make changes to the events in your current timeline, back to the commit you drag this to.
it: Cambia gli eventi della linea temporale fino al commit su cui hai trascinato questa scheda.

source: Continue the current rebasing process.
it: Continua il processo di rebasing

source: Move the branch you're on to the specified commit.
it: Sposta il branch su cui ti trovi al commit specificato.

source: Jump to the commit, and update the index. Keep the current environment.
it: Salta al commit e aggiorna l'indice. Mantieni l'ambiente attuale.

source: Reset the index version of a file to the version in the commit you're on.
it: Resetta la versione dell'indice di un file alla versione del commit in cui sei

source: Repeat the specified action on top of your current timeline.
it: Ripete l'azione specificata, in cima alla linea temporale corrente

source: Make a new commit that reverts the changes of the speicified commit.
it: Crea un nuovo commit che annulla le modifiche del commit specificato.

source: Start looking for the commit where things got bad.
it: Inizia a cercare il commit dove le cose sono andate storte

source: State that the current commit is good! When you're automatically transferred, keep playing the `good` and `bad` cards!
it: Dichiara che l'attuale commit è buono! Continua a giocare con le carte `buono` e `cattivo`!

source: State that the current commit is bad! When you're automatically transferred, keep playing the `good` and `bad` cards!
it: Dichiara che l'attuale commit non è valido! Continua a giocare con le carte `buone` e `cattive`!

source: Update the index version of the file to its current real content.
it: Aggiorna la versione in indice del file con il contenuto attuale.

source: Delete a file both in the working directory, as well as the index.
it: Cancella un file sia dalla cartella di lavoro corrente che dall'indice.

source: Make a commit from the current index.
it: Crea un commit dall'indice corrente.

source: Show what changed in the commit.
it: Mostra cosa è cambiato nel commit.

source: Create a new branch at your current location.
it: Crea un nuovo branch alla posizione corrente.

source: Delete a branch.
it: Cancella un branch.

source: Display a log of where the ref pointed to in the past.
it: Mostra un log di dove il riferimento (ref) ha puntato in passato.

source: Create a new file.
it: Crea un nuovo file.

source: Delete a file.
it: Cancella un file.

source: Rename a file.
it: Rinomina un file.

source: Make a copy of a file.
it: Crea una copia di un file.

source: Amici
it: Friend
